final Map<String, List<String>> cropCategories = {
  "ධාන්‍ය බෝග ": ["වී", "ගම්මුදු", "බඩ ඉරිඟු", "කඩල","සුදු කවුපි","රතු කවුපි","කලු කවුපි","මුං ඇට"],
  "මුලබෝග": ["අල", "රතු අල", "කැරට්","රාබු"],
  "පලතුරු බෝග": ["කෙසෙල්", "අඹ", "මිදි"],
  "එළවළු බෝග": ["තක්කාලි", "ගෝවා", "පිපිඤ්ඤා", "ලූනු"],
  "පාන බෝග": ["තේ", "කෝපි", "කෝකෝ"],
  "ඖෂධීය සහ සුගන්ධ බෝග": ["අළෝ වෙරා", "කොහොඹ", "ලැවෙන්ඩර්"]
};

final Map<String, List<String>> districtCities = {
  "කොළඹ": ["කොළඹ", "දෙහිවල", "මොරටුව", "නුගේගොඩ", "කොට්ටාව"],
  "ගම්පහ": ["ගම්පහ", "නෙගොම්බෝ", "කඩවත", "ජා-ඇල", "රාගම"],
  "කළුතර": ["කළුතර", "පානදුර", "බේරුවල", "හොරණ", "මතුගම"],
  "මහනුවර": ["මහනුවර", "පේරාදෙණිය", "කටුගස්තොට", "ගම්පොල", "නුවරඑළිය"],
  "මාතලේ": ["මාතලේ", "දඹුල්ල", "ගලේවෙල", "උකුවෙල", "රත්තොට"],
  "නුවරඑළිය": ["නුවරඑළිය", "හැටන්", "තලවාකැලේ", "වටවල", "ගිනිගත්හේන"],
  "ගාල්ල": ["ගාල්ල", "හික්කඩුව", "අම්බලන්ගොඩ", "කරාපිටිය", "බද්දෙගම"],
  "මාතර": ["මාතර", "වැලිගම", "දෙණියාය", "අකුරස්ස", "කඹුරුපිටිය"],
  "හම්බන්තොට": ["හම්බන්තොට", "තංගල්ල", "තිස්සමහාරාම", "බෙලිඅත්ත", "වීරකැටිය"],
  "යාපනය": ["යාපනය", "නල්ලුර්", "චාවකච්චේරි", "පොයින්ට් පේඩ්‍රෝ", "කොඩිකාමම්"],
  "කිලිනොච්චි": ["කිලිනොච්චි", "පල්ලයි", "පරන්තන්", "මුලන්කාවිල්", "දර්මපුරම්"],
  "මන්නාරම": ["මන්නාරම", "පෙසලෙයි", "මුරුන්කන්", "අඩම්පන්", "මඩු"],
  "වවුනියාව": ["වවුනියාව", "චෙඩ්ඩිකුලම්", "නෙඩුන්කේණි", "ඔමාන්තෙයි", "පම්පයිමඩු"],
  "මුලතිවු": ["මුලතිවු", "පුදුකුඩියිරුප්පු", "ඔඩ්ඩුසුද්දන්", "තුනුක්කයි", "මාරිටයිම්පත්තුව"],
  "මඩකලපුව": ["මඩකලපුව", "එරාවූර්", "කට්ටන්කුඩි", "කළුවාංචිකුඩි", "වක්කරෙයි"],
  "අම්පාර": ["අම්පාර", "කල්මුනේ", "සෛන්තමරுது", "අක්කරයිපත්තුව", "සම්මාන්තුරෙයි"],
  "ත්‍රිකුණාමලය": ["ත්‍රිකුණාමලය", "කින්නියා", "මුතූර්", "කන්තලේ", "නීලවෙළි"],
  "කුරුණෑගල": ["කුරුණෑගල", "කුලියාපිටිය", "වාරියපොල", "මාවතගම", "නාරම්මල"],
  "පුත්තලම": ["පුත්තලම", "හිල්ලාව", "වෙන්නප්පුව", "අනමදූව", "නාත්තන්ඩිය"],
  "අනුරාධපුරය": ["අනුරාධපුරය", "කැකිරාව", "මැදවච්චිය", "තඹුත්තෙගම", "නොච්චියාගම"],
  "පොළොන්නරුව": ["පොළොන්නරුව", "හිඟුරක්ගොඩ", "මැදිරිගිරිය", "දිඹුලගල", "ඇලහැර"],
  "බදුල්ල": ["බදුල්ල", "බණ්ඩාරවෙල", "හපුතලේ", "වෙලිමඩ", "මහියංගනය"],
  "මොණරාගල": ["මොණරාගල", "වැල්ලවාය", "බිබිල", "මැදගම", "බුත්තල"],
  "රත්නපුර": ["රත්නපුර", "ඇඹිලිපිටිය", "බලන්ගොඩ", "පැල්මඩුල්ල", "ගොඩකවෙල"],
  "කෑගල්ල": ["කෑගල්ල", "මාවනැල්ල", "වරකාපොල", "රඹුක්කන", "දෙහිඕවිට"]
};
